pulmanturbd/certification2/CabinHoldRQ.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hol="http://services.rccl.com/Interfaces/HoldCabin" xmlns:alp="http://www.opentravel.org/OTA/2003/05/alpha">
   <soapenv:Header/>
   <soapenv:Body>
      <hol:holdCabin>
      <OTA_CruiseCabinHoldRQ Version="1.0" Target="Test" SequenceNmbr="1" TimeStamp="2008-12-30T18:30:42.720+05:30" xmlns="http://www.opentravel.org/OTA/2003/05/alpha">
         <POS>
            <Source TerminalID="12502LDJW6" ISOCurrency="USD">
               <RequestorID ID="313917" ID_Context="AGENCY1" Type="5"/>
               <BookingChannel Type="7">
                  <CompanyName CompanyShortName="PULLMANTUR"/>
               </BookingChannel>
            </Source>
            <Source TerminalID="12502LDJW6" ISOCurrency="USD">
               <RequestorID ID="313917" ID_Context="AGENCY2" Type="5"/>
               <BookingChannel Type="7">
                  <CompanyName CompanyShortName="PULLMANTUR"/>
               </BookingChannel>
            </Source>
            <Source TerminalID="12502LDJW6" ISOCurrency="USD">
               <RequestorID ID="313917" ID_Context="AGENT1" Type="5"/>
               <BookingChannel Type="7">
                  <CompanyName CompanyShortName="PULLMANTUR"/>
               </BookingChannel>
            </Source>
         </POS>
         <GuestCounts>
            <GuestCount Age="30" Quantity="1"/>
         </GuestCounts>
         <SelectedSailing Start="2021-02-07" ShipCode="HR" VendorCode="PUL">
            <SelectedFare FareCode="BESTRATE" GroupCode="1"/>
            <SelectedCategory BerthedCategoryCode="GS" PricedCategoryCode="GS">
                <!--Optional:-->
                <CabinAttributes>
                    <!--1 to 99 repetitions:-->
                    <CabinAttribute CabinAttributeCode="99"/>
                </CabinAttributes>
                <!--1 to 4 repetitions:-->
               <SelectedCabin CabinNumber="1071" MaxOccupancy="4"/>
            </SelectedCategory>
            <InclusivePackageOption CruisePackageCode="HRPO0720" InclusiveIndicator="false"/>
         </SelectedSailing>
         <!--0 to 9 repetitions:-->
         <Guest Code="10" Age="30"/>
         <!--Optional:-->
            <alp:Currency CurrencyCode="USD" DecimalPlaces="2"/>
         <!--Optional:-->
        <SearchQualifiers BerthedCategoryCode="GS" PricedCategoryCode="GS" CabinNumber="1071" GroupCode="1" MaxOccupancy="4" DeckNumber="10" DeckName="CUBIERTA 10">
            <!--0 to 5 repetitions:-->
            <Status Status="36"/>
            <!--Optional:-->
            <Dining Sitting="M"/>
        </SearchQualifiers>
      </OTA_CruiseCabinHoldRQ>
      </hol:holdCabin>
   </soapenv:Body>
</soapenv:Envelope>